[
  {
    "name": "SQL Injection",
    "issueBackground": "SQL Injection occurs when an attacker manipulates an application's SQL queries by injecting malicious input. This can lead to unauthorized access, data retrieval, modification, or deletion within the database. For example, an attacker might input ' OR '1'='1' -- to bypass authentication mechanisms.",
    "Recommendations" :[ 
    "Ensure server-side validation of user permissions for every resource request or action.",
    "Verify that users can access only the resources they are authorized to view or modify.",
    "Replace direct object references with securely generated indirect identifiers (e.g., UUIDs, tokenized IDs).",
    "Use RBAC to grant access to resources based on user roles and the principle of least privilege."
  ],
    "relatedLinks": [
      "https://www.varonis.com/blog/what-is-idor-insecure-direct-object-reference",
      "https://www.varonis.com/blog/what-is-idor-insecure-direct-object-reference"
    ]    
  },
  {
    "name": "Insecure Direct Object Reference (IDOR)",
    "issueBackground": "Insecure Direct Object References (IDOR) is a type of access control vulnerability that occurs when an application provides direct access to objects (e.g., files, database records, or URLs) based on user-supplied input without proper authorization checks. This flaw allows attackers to manipulate parameters to gain unauthorized access to sensitive resources or perform actions intended for other users, potentially compromising the confidentiality, integrity, and security of the application.",
    "Recommendations" :[ 
    "Ensure server-side validation of user permissions for every resource request or action.",
    "Verify that users can access only the resources they are authorized to view or modify.",
    "Replace direct object references with securely generated indirect identifiers (e.g., UUIDs, tokenized IDs).",
    "Use RBAC to grant access to resources based on user roles and the principle of least privilege."
  ],
    "relatedLinks": [
      "https://www.varonis.com/blog/what-is-idor-insecure-direct-object-reference",
      "https://www.varonis.com/blog/what-is-idor-insecure-direct-object-reference"
    ]
  }
]